; domain
(define (domain rover)
(:requirements :typing)
(:types 	rover waypoint store camera mode lander objective - object
)

(:predicates (at ?x - rover ?y - waypoint)
	(at_lander ?x - lander ?y - waypoint)
	(can_traverse ?r - rover ?x - waypoint ?y - waypoint)
	(equipped_for_soil_analysis ?r - rover)
	(equipped_for_rock_analysis ?r - rover)
	(equipped_for_imaging ?r - rover)
	(empty ?s - store)
	(have_rock_analysis ?r - rover ?w - waypoint)
	(have_soil_analysis ?r - rover ?w - waypoint)
	(full ?s - store)
	(calibrated ?c - camera ?r - rover)
	(supports ?c - camera ?m - mode)
	(available ?r - rover)
	(visible ?w - waypoint ?p - waypoint)
	(have_image ?r - rover ?o - objective ?m - mode)
	(communicated_soil_data ?w - waypoint)
	(communicated_rock_data ?w - waypoint)
	(communicated_image_data ?o - objective ?m - mode)
	(at_soil_sample ?w - waypoint)
	(at_rock_sample ?w - waypoint)
	(visible_from ?o - objective ?w - waypoint)
	(store_of ?s - store ?r - rover)
	(calibration_target ?i - camera ?o - objective)
	(on_board ?i - camera ?r - rover)
	(channel_free ?l - lander)
)

(:action navigate
	:parameters   (?x - rover ?y - waypoint ?z - waypoint)
	:precondition (and (visible ?y ?z) (can_traverse ?x ?y ?z) (available ?x) (at ?x ?y))
	:effect       (and (at ?x ?z) (not (at ?x ?y))
))

(:action sample_soil
	:parameters   (?x - rover ?s - store ?p - waypoint)
	:precondition (and (store_of ?s ?x) (equipped_for_soil_analysis ?x) (at ?x ?p) (empty ?s) (at_soil_sample ?p))
	:effect       (and (have_soil_analysis ?x ?p) (full ?s) (not (empty ?s)) (not (at_soil_sample ?p))
))

(:action sample_rock
	:parameters   (?x - rover ?s - store ?p - waypoint)
	:precondition (and (store_of ?s ?x) (at ?x ?p) (empty ?s) (equipped_for_rock_analysis ?x) (at_rock_sample ?p))
	:effect       (and (have_rock_analysis ?x ?p) (full ?s) (not (empty ?s)) (not (at_rock_sample ?p))
))

(:action drop
	:parameters   (?x - rover ?y - store)
	:precondition (and (store_of ?y ?x) (full ?y))
	:effect       (and (empty ?y) (not (full ?y))
))

(:action calibrate
	:parameters   (?r - rover ?i - camera ?t - objective ?w - waypoint)
	:precondition (and (calibration_target ?i ?t) (visible_from ?t ?w) (on_board ?i ?r) (equipped_for_imaging ?r) (at ?r ?w))
	:effect       (and (calibrated ?i ?r)
))

(:action take_image
	:parameters   (?r - rover ?p - waypoint ?o - objective ?i - camera ?m - mode)
	:precondition (and (at ?r ?p) (supports ?i ?m) (on_board ?i ?r) (equipped_for_imaging ?r) (calibrated ?i ?r) (visible_from ?o ?p))
	:effect       (and (have_image ?r ?o ?m) (not (calibrated ?i ?r))
))

(:action communicate_soil_data
	:parameters   (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
	:precondition (and (available ?r) (have_soil_analysis ?r ?p) (channel_free ?l) (visible ?x ?y) (at ?r ?x) (at_lander ?l ?y))
	:effect       (and (communicated_soil_data ?p)
))

(:action communicate_rock_data
	:parameters   (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
	:precondition (and (available ?r) (channel_free ?l) (visible ?x ?y) (have_rock_analysis ?r ?p) (at ?r ?x) (at_lander ?l ?y))
	:effect       (and (communicated_rock_data ?p)
))

(:action communicate_image_data
	:parameters   (?r - rover ?l - lander ?o - objective ?m - mode ?x - waypoint ?y - waypoint)
	:precondition (and (available ?r) (have_image ?r ?o ?m) (channel_free ?l) (visible ?x ?y) (at ?r ?x) (at_lander ?l ?y))
	:effect       (and (communicated_image_data ?o ?m)
))
)

; problem
(define (problem roverprob5077) (:domain Rover)
(:objects
	general - Lander
	colour high_res low_res - Mode
	rover0 rover1 rover2 - Rover
	rover0store rover1store rover2store - Store
	waypoint0 waypoint1 waypoint2 waypoint3 waypoint4 waypoint5 waypoint6 - Waypoint
	camera0 camera1 camera2 - Camera
	objective0 objective1 objective2 - Objective
	)
(:init
	(visible waypoint0 waypoint3)
	(visible waypoint3 waypoint0)
	(visible waypoint0 waypoint4)
	(visible waypoint4 waypoint0)
	(visible waypoint1 waypoint5)
	(visible waypoint5 waypoint1)
	(visible waypoint1 waypoint6)
	(visible waypoint6 waypoint1)
	(visible waypoint2 waypoint4)
	(visible waypoint4 waypoint2)
	(visible waypoint2 waypoint5)
	(visible waypoint5 waypoint2)
	(visible waypoint3 waypoint1)
	(visible waypoint1 waypoint3)
	(visible waypoint3 waypoint2)
	(visible waypoint2 waypoint3)
	(visible waypoint3 waypoint4)
	(visible waypoint4 waypoint3)
	(visible waypoint5 waypoint0)
	(visible waypoint0 waypoint5)
	(visible waypoint5 waypoint4)
	(visible waypoint4 waypoint5)
	(visible waypoint6 waypoint0)
	(visible waypoint0 waypoint6)
	(visible waypoint6 waypoint2)
	(visible waypoint2 waypoint6)
	(visible waypoint6 waypoint4)
	(visible waypoint4 waypoint6)
	(visible waypoint6 waypoint5)
	(visible waypoint5 waypoint6)
	(at_soil_sample waypoint0)
	(at_rock_sample waypoint0)
	(at_soil_sample waypoint1)
	(at_rock_sample waypoint1)
	(at_soil_sample waypoint2)
	(at_rock_sample waypoint2)
	(at_rock_sample waypoint3)
	(at_soil_sample waypoint4)
	(at_rock_sample waypoint4)
	(at_soil_sample waypoint5)
	(at_soil_sample waypoint6)
	(at_rock_sample waypoint6)
	(at_lander general waypoint6)
	(channel_free general)
	(at rover0 waypoint1)
	(available rover0)
	(store_of rover0store rover0)
	(empty rover0store)
	(equipped_for_soil_analysis rover0)
	(equipped_for_imaging rover0)
	(can_traverse rover0 waypoint1 waypoint3)
	(can_traverse rover0 waypoint3 waypoint1)
	(can_traverse rover0 waypoint1 waypoint6)
	(can_traverse rover0 waypoint6 waypoint1)
	(can_traverse rover0 waypoint3 waypoint4)
	(can_traverse rover0 waypoint4 waypoint3)
	(at rover1 waypoint5)
	(available rover1)
	(store_of rover1store rover1)
	(empty rover1store)
	(equipped_for_soil_analysis rover1)
	(equipped_for_rock_analysis rover1)
	(equipped_for_imaging rover1)
	(can_traverse rover1 waypoint5 waypoint0)
	(can_traverse rover1 waypoint0 waypoint5)
	(can_traverse rover1 waypoint5 waypoint4)
	(can_traverse rover1 waypoint4 waypoint5)
	(can_traverse rover1 waypoint5 waypoint6)
	(can_traverse rover1 waypoint6 waypoint5)
	(can_traverse rover1 waypoint0 waypoint3)
	(can_traverse rover1 waypoint3 waypoint0)
	(can_traverse rover1 waypoint4 waypoint2)
	(can_traverse rover1 waypoint2 waypoint4)
	(can_traverse rover1 waypoint6 waypoint1)
	(can_traverse rover1 waypoint1 waypoint6)
	(at rover2 waypoint1)
	(available rover2)
	(store_of rover2store rover2)
	(empty rover2store)
	(equipped_for_imaging rover2)
	(can_traverse rover2 waypoint1 waypoint3)
	(can_traverse rover2 waypoint3 waypoint1)
	(can_traverse rover2 waypoint1 waypoint6)
	(can_traverse rover2 waypoint6 waypoint1)
	(can_traverse rover2 waypoint3 waypoint0)
	(can_traverse rover2 waypoint0 waypoint3)
	(on_board camera0 rover0)
	(calibration_target camera0 objective2)
	(supports camera0 colour)
	(supports camera0 high_res)
	(on_board camera1 rover1)
	(calibration_target camera1 objective0)
	(supports camera1 colour)
	(supports camera1 high_res)
	(supports camera1 low_res)
	(on_board camera2 rover2)
	(calibration_target camera2 objective2)
	(supports camera2 high_res)
	(visible_from objective0 waypoint6)
	(visible_from objective1 waypoint0)
	(visible_from objective1 waypoint3)
	(visible_from objective2 waypoint0)
	(visible_from objective2 waypoint6)
)

(:goal (and
(communicated_soil_data waypoint4)
(communicated_soil_data waypoint1)
(communicated_soil_data waypoint6)
(communicated_soil_data waypoint0)
(communicated_soil_data waypoint2)
(communicated_soil_data waypoint5)
(communicated_rock_data waypoint1)
(communicated_rock_data waypoint0)
(communicated_rock_data waypoint3)
(communicated_rock_data waypoint6)
(communicated_rock_data waypoint2)
(communicated_rock_data waypoint4)
(communicated_image_data objective1 high_res)
(communicated_image_data objective1 colour)
(communicated_image_data objective1 low_res)
(communicated_image_data objective2 high_res)
(communicated_image_data objective0 colour)
	)
)
)

; plan
1. (sample_soil rover1 rover1store waypoint5)
   deleted: (empty rover1store) (at_soil_sample waypoint5)
   added: (have_soil_analysis rover1 waypoint5) (full rover1store)
   goals met: 0 of 17
2. (navigate rover1 waypoint5 waypoint6)
   deleted: (at rover1 waypoint5)
   added: (at rover1 waypoint6)
   goals met: 0 of 17
3. (calibrate rover1 camera1 objective0 waypoint6)
   added: (calibrated camera1 rover1)
   goals met: 0 of 17
4. (take_image rover1 waypoint6 objective2 camera1 high_res)
   deleted: (calibrated camera1 rover1)
   added: (have_image rover1 objective2 high_res)
   goals met: 0 of 17
5. (calibrate rover1 camera1 objective0 waypoint6)
   added: (calibrated camera1 rover1)
   goals met: 0 of 17
6. (take_image rover1 waypoint6 objective0 camera1 colour)
   deleted: (calibrated camera1 rover1)
   added: (have_image rover1 objective0 colour)
   goals met: 0 of 17
7. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 0 of 17
8. (sample_rock rover1 rover1store waypoint6)
   deleted: (empty rover1store) (at_rock_sample waypoint6)
   added: (have_rock_analysis rover1 waypoint6) (full rover1store)
   goals met: 0 of 17
9. (navigate rover1 waypoint6 waypoint1)
   deleted: (at rover1 waypoint6)
   added: (at rover1 waypoint1)
   goals met: 0 of 17
10. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 0 of 17
11. (sample_soil rover1 rover1store waypoint1)
   deleted: (empty rover1store) (at_soil_sample waypoint1)
   added: (have_soil_analysis rover1 waypoint1) (full rover1store)
   goals met: 0 of 17
12. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 0 of 17
13. (sample_rock rover1 rover1store waypoint1)
   deleted: (empty rover1store) (at_rock_sample waypoint1)
   added: (have_rock_analysis rover1 waypoint1) (full rover1store)
   goals met: 0 of 17
14. (navigate rover1 waypoint1 waypoint6)
   deleted: (at rover1 waypoint1)
   added: (at rover1 waypoint6)
   goals met: 0 of 17
15. (calibrate rover1 camera1 objective0 waypoint6)
   added: (calibrated camera1 rover1)
   goals met: 0 of 17
16. (navigate rover1 waypoint6 waypoint5)
   deleted: (at rover1 waypoint6)
   added: (at rover1 waypoint5)
   goals met: 0 of 17
17. (navigate rover1 waypoint5 waypoint0)
   deleted: (at rover1 waypoint5)
   added: (at rover1 waypoint0)
   goals met: 0 of 17
18. (take_image rover1 waypoint0 objective1 camera1 low_res)
   deleted: (calibrated camera1 rover1)
   added: (have_image rover1 objective1 low_res)
   goals met: 0 of 17
19. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 0 of 17
20. (sample_soil rover1 rover1store waypoint0)
   deleted: (empty rover1store) (at_soil_sample waypoint0)
   added: (have_soil_analysis rover1 waypoint0) (full rover1store)
   goals met: 0 of 17
21. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 0 of 17
22. (sample_rock rover1 rover1store waypoint0)
   deleted: (empty rover1store) (at_rock_sample waypoint0)
   added: (have_rock_analysis rover1 waypoint0) (full rover1store)
   goals met: 0 of 17
23. (navigate rover1 waypoint0 waypoint3)
   deleted: (at rover1 waypoint0)
   added: (at rover1 waypoint3)
   goals met: 0 of 17
24. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 0 of 17
25. (sample_rock rover1 rover1store waypoint3)
   deleted: (empty rover1store) (at_rock_sample waypoint3)
   added: (have_rock_analysis rover1 waypoint3) (full rover1store)
   goals met: 0 of 17
26. (navigate rover1 waypoint3 waypoint0)
   deleted: (at rover1 waypoint3)
   added: (at rover1 waypoint0)
   goals met: 0 of 17
27. (navigate rover1 waypoint0 waypoint5)
   deleted: (at rover1 waypoint0)
   added: (at rover1 waypoint5)
   goals met: 0 of 17
28. (navigate rover1 waypoint5 waypoint4)
   deleted: (at rover1 waypoint5)
   added: (at rover1 waypoint4)
   goals met: 0 of 17
29. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 0 of 17
30. (sample_soil rover1 rover1store waypoint4)
   deleted: (empty rover1store) (at_soil_sample waypoint4)
   added: (have_soil_analysis rover1 waypoint4) (full rover1store)
   goals met: 0 of 17
31. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 0 of 17
32. (sample_rock rover1 rover1store waypoint4)
   deleted: (empty rover1store) (at_rock_sample waypoint4)
   added: (have_rock_analysis rover1 waypoint4) (full rover1store)
   goals met: 0 of 17
33. (navigate rover1 waypoint4 waypoint2)
   deleted: (at rover1 waypoint4)
   added: (at rover1 waypoint2)
   goals met: 0 of 17
34. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 0 of 17
35. (sample_soil rover1 rover1store waypoint2)
   deleted: (empty rover1store) (at_soil_sample waypoint2)
   added: (have_soil_analysis rover1 waypoint2) (full rover1store)
   goals met: 0 of 17
36. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 0 of 17
37. (sample_rock rover1 rover1store waypoint2)
   deleted: (empty rover1store) (at_rock_sample waypoint2)
   added: (have_rock_analysis rover1 waypoint2) (full rover1store)
   goals met: 0 of 17
38. (navigate rover2 waypoint1 waypoint3)
   deleted: (at rover2 waypoint1)
   added: (at rover2 waypoint3)
   goals met: 0 of 17
39. (navigate rover2 waypoint3 waypoint0)
   deleted: (at rover2 waypoint3)
   added: (at rover2 waypoint0)
   goals met: 0 of 17
40. (navigate rover0 waypoint1 waypoint6)
   deleted: (at rover0 waypoint1)
   added: (at rover0 waypoint6)
   goals met: 0 of 17
41. (communicate_soil_data rover1 general waypoint4 waypoint2 waypoint6)
   added: (communicated_soil_data waypoint4)
   goals met: 1 of 17
42. (communicate_soil_data rover1 general waypoint2 waypoint2 waypoint6)
   added: (communicated_soil_data waypoint2)
   goals met: 2 of 17
43. (communicate_soil_data rover1 general waypoint1 waypoint2 waypoint6)
   added: (communicated_soil_data waypoint1)
   goals met: 3 of 17
44. (communicate_soil_data rover1 general waypoint0 waypoint2 waypoint6)
   added: (communicated_soil_data waypoint0)
   goals met: 4 of 17
45. (communicate_rock_data rover1 general waypoint6 waypoint2 waypoint6)
   added: (communicated_rock_data waypoint6)
   goals met: 5 of 17
46. (communicate_rock_data rover1 general waypoint4 waypoint2 waypoint6)
   added: (communicated_rock_data waypoint4)
   goals met: 6 of 17
47. (communicate_rock_data rover1 general waypoint3 waypoint2 waypoint6)
   added: (communicated_rock_data waypoint3)
   goals met: 7 of 17
48. (communicate_rock_data rover1 general waypoint2 waypoint2 waypoint6)
   added: (communicated_rock_data waypoint2)
   goals met: 8 of 17
49. (communicate_rock_data rover1 general waypoint1 waypoint2 waypoint6)
   added: (communicated_rock_data waypoint1)
   goals met: 9 of 17
50. (communicate_rock_data rover1 general waypoint0 waypoint2 waypoint6)
   added: (communicated_rock_data waypoint0)
   goals met: 10 of 17
51. (communicate_image_data rover1 general objective2 high_res waypoint2 waypoint6)
   added: (communicated_image_data objective2 high_res)
   goals met: 11 of 17
52. (communicate_image_data rover1 general objective1 low_res waypoint2 waypoint6)
   added: (communicated_image_data objective1 low_res)
   goals met: 12 of 17
53. (communicate_image_data rover1 general objective0 colour waypoint2 waypoint6)
   added: (communicated_image_data objective0 colour)
   goals met: 13 of 17
54. (calibrate rover2 camera2 objective2 waypoint0)
   added: (calibrated camera2 rover2)
   goals met: 13 of 17
55. (calibrate rover0 camera0 objective2 waypoint6)
   added: (calibrated camera0 rover0)
   goals met: 13 of 17
56. (communicate_soil_data rover1 general waypoint5 waypoint2 waypoint6)
   added: (communicated_soil_data waypoint5)
   goals met: 14 of 17
57. (sample_soil rover0 rover0store waypoint6)
   deleted: (empty rover0store) (at_soil_sample waypoint6)
   added: (have_soil_analysis rover0 waypoint6) (full rover0store)
   goals met: 14 of 17
58. (navigate rover0 waypoint6 waypoint1)
   deleted: (at rover0 waypoint6)
   added: (at rover0 waypoint1)
   goals met: 14 of 17
59. (communicate_soil_data rover0 general waypoint6 waypoint1 waypoint6)
   added: (communicated_soil_data waypoint6)
   goals met: 15 of 17
60. (navigate rover0 waypoint1 waypoint3)
   deleted: (at rover0 waypoint1)
   added: (at rover0 waypoint3)
   goals met: 15 of 17
61. (take_image rover0 waypoint3 objective1 camera0 colour)
   deleted: (calibrated camera0 rover0)
   added: (have_image rover0 objective1 colour)
   goals met: 15 of 17
62. (navigate rover0 waypoint3 waypoint1)
   deleted: (at rover0 waypoint3)
   added: (at rover0 waypoint1)
   goals met: 15 of 17
63. (communicate_image_data rover0 general objective1 colour waypoint1 waypoint6)
   added: (communicated_image_data objective1 colour)
   goals met: 16 of 17
64. (take_image rover2 waypoint0 objective1 camera2 high_res)
   deleted: (calibrated camera2 rover2)
   added: (have_image rover2 objective1 high_res)
   goals met: 16 of 17
65. (communicate_image_data rover2 general objective1 high_res waypoint0 waypoint6)
   added: (communicated_image_data objective1 high_res)
   goals met: 17 of 17
